#include<stdio.h>

int main()
{
	int i, j, k, g, s = 0;
	int a[10];
	for (i = 192; i <= 329; i++)  //尝试所有最小数范围
	{
		s = 0;
		for (g = 1; g <= 9; g++)  //重置统计数组
			a[g] = 0;
		a[i / 100] = 1;		//计算最小数各位数字，并统计
		a[i / 10 % 10] = 1;
		a[i % 10] = 1;
		j = i * 2;		//计算2倍数字
		a[j / 100] = 1;		 //计算2倍数各位数字，并统计
		a[j / 10 % 10] = 1;
		a[j % 10] = 1;
		k = i * 3;		 //计算3倍数字
		a[k / 100] = 1;		 //计算3倍数各位数字，并统计
		a[k / 10 % 10] = 1;
		a[k % 10] = 1;
		for (g = 1; g <= 9; g++) //统计数组之和
			s = s + a[g];
		if (s == 9)		//若数组之和为9，则为解
			printf("%d,%d,%d\n", i, j, k);
	}
}
